Day2_MY_FRIST_SOAPSCRIPT_USING_WEB_SERVICES_PROTOCOL/result1/Iteration1/t1_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\HP\LoadRunner\">
  <http>
    <request>
      <header>POST /websamples.countryinfo/CountryInfoService.wso HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: ""
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: webservices.oorsprong.org
Content-Length: 764

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;
    &lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:37b62f2a-f183-4028-be72-3631c7cbc592&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo"&gt;
      &lt;sCountryISOCode&gt;AUS&lt;/sCountryISOCode&gt;
    &lt;/CapitalCity&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Encoding: gzip
Vary: Accept-Encoding
Server: Microsoft-IIS/8.5
Web-Service: DataFlex 18.2
Date: Sat, 15 Dec 2018 10:36:08 GMT
Content-Length: 310

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soap:Body&gt;
    &lt;m:CapitalCityResponse xmlns:m="http://www.oorsprong.org/websamples.countryinfo"&gt;
      &lt;m:CapitalCityResult&gt;Canberra&lt;/m:CapitalCityResult&gt;
    &lt;/m:CapitalCityResponse&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </response>
  </http>
</report>